// See https://aka.ms/new-console-template for more information

Console.WriteLine("Hello, World!");
return;

/*
Конструкторское бюро проектирование автомобилей

   Car(Автомобиль) - средство передвижения собранное по чертежу
   
   Test(Тест) - комплекс мероприятий направленный на проверку какой-то концепции
   
   Blueprint(Чертеж) - документ содержащий описание устройства автомобиля
   
   Проект(Project) - комплекс действий направленный на создание автомобиля
*/

/*
Страховая компания

  Policy(Страховая полис) - документ содержащий информацию о страховом покрытии

  Client(Клиент) - лицо, которое приобретает страховой полис

  InsuranceEvent(Страховой случай) - событие, которое приводит к страховому случаю

  Broker(Страховой брокер) - лицо, которое заключает страховой полис

  Use Cases:
   Создание страхового полиса
     1. Клиент заключает страховой полис с брокером
     2. Страховой полис содержит информацию о страховом покрытии, клиента и брокере

   Выплата страховой премии
     1. Регистрируется страховой случай
     2. Страховой полис содержит информацию о страховом случае
     3. Клиент получает выплату страховой премии
*/
